####################################################################################
# Преобразовать словарь в текстовый файл (вариант 1)
a = {'One': 1, 'Two': 2}
with open('text.txt', 'w') as file:
  for key, value in a.items():
    file.write(f'{key}, {value}\n')
####################################################################################
# Преобразовать словарь в текстовый файл (вариант 2)
file = open('text.txt', 'w')
for key, value in a.items():
  file.write(f'{key}, {value}\n')
file.close()
####################################################################################