####################################################################################
# создание словаря
print('**********создание словаря********')
# my_dict = {}
my_dict = dict()
print(my_dict)
####################################################################################
# проверка словаря - пустой или нет
print('**********проверка словаря - пустой или нет********')
try:
    if my_dict['key'] is None:
        raise KeyError
    else:
        print('Dict() is Full')
except KeyError:
    print('Dict() is None')
####################################################################################
# словарь списков
print('**********словарь списков********')
my_dict['key'] = ['one']
my_dict['key'] += ['two']
my_dict['key'].append('three')
print(my_dict)
####################################################################################
# проверка словаря - пустой или нет
print('**********проверка словаря - пустой или нет********')
try:
    if my_dict['key'] is None:
        print('Dict() is None')
    else:
        print('Dict() is Full')
except KeyError:
    print('Dict() is None')
####################################################################################