####################################################################################
# создание словаря
print('**********создание словаря********')
# my_dict = {}
my_dict = dict()
print(my_dict)
####################################################################################
# проверка словаря - пустой или нет
print('**********проверка словаря - пустой или нет********')
try:
    if my_dict['key'] is None:
        raise KeyError
    else:
        print('Dict() is Full')
except KeyError:
    print('Dict() is None')
####################################################################################
# словарь списков
print('**********словарь списков********')
my_dict['key'] = ['one']
my_dict['key'] += ['two']
my_dict['key'].append('three')
print(my_dict)
####################################################################################
# проверка словаря - пустой или нет
print('**********проверка словаря - пустой или нет********')
try:
    if my_dict['key'] is None:
        print('Dict() is None')
    else:
        print('Dict() is Full')
except KeyError:
    print('Dict() is None')
####################################################################################
# объединение словарей:
print('**********объединение словарей********')

data1 = {"max": 36, "red": 36}
data2 = {"max": 37, "next": 38}

data_total_1 = data1 | data2
print(data_total_1)

data_total_2 = {**data1, **data2}
print(data_total_2)

# конкатенация словарей, обновили data1, 
# значения сохранятся при совпадении ключей из data2
data1.update(data2) 
print(data1)
####################################################################################