####################################################################################
'''
Использование модуля pynput.keyboard библиотеки pynput в Python.
Модуль pynput.keyboard библиотеки pynput содержит классы для управления и мониторинга клавиатуры.
'''
####################################################################################
'''
Управление клавиатурой.
Для управления клавиатурой используйте класс keyboard.Controller следующим образом:
'''
from pynput.keyboard import Key, Controller

keyboard = Controller()

# Нажимает и отпускает клавишу пробела
print('-1----------------')
keyboard.press(Key.space)
keyboard.release(Key.space)
print('\n-1----------------')

# печатает строчную букву `a`, будет работать, даже если ни 
# одна клавиша на физической клавиатуре не помечена буквой `a`.
print('-2----------------')
keyboard.press('a')
keyboard.release('a')
print('\n-2----------------')

# печатает две заглавные буквы `A`:
# выводим сразу заглавную 'A'
print('-3----------------')
keyboard.press('A')
keyboard.release('A')
# выводим заглавную 'A' через нажатие `Key.shift`
with keyboard.pressed(Key.shift):
    keyboard.press('a')
    keyboard.release('a')
print('\n-3----------------')

# печатает 'Hello World', используя метод быстрого ввода
print('-4----------------')
keyboard.type('Hello World')
print('\n-4----------------')

# вывод
'''
red@red:~/WORK/PYTHON/MyPROG/Python.Example$ python pynput.keyboard.py
-1----------------

-1----------------
-2----------------
 a
-2----------------
-3----------------
AA
-3----------------
-4----------------
Hello World
-4----------------
red@red:~/WORK/PYTHON/MyPROG/Python.Example$ aAAHello World
'''
####################################################################################
'''

'''
####################################################################################

####################################################################################