####################################################################################
# подключаем модуль random
import random
####################################################################################
# входные данные для тестирования
print('**********for tests********')

arr = [i for i in range(1,11)]
print('len(arr) =', len(arr))
print(arr)
####################################################################################
# random.choice()
print('**********random.choice()*********')

rnd = random.choice(arr)
print(rnd)
####################################################################################
# random.choices()
print('**********random.choices()********')

rnd = random.choices(arr)
print(rnd)

rnd = random.choices(arr, k=5)
print(rnd)

rnd = random.choices(arr, k=20)
print(rnd)
####################################################################################